1. Use CDP to identify which interfaces are used to connect the routers and switches.
2. Determine which side of the serial connection between R1 and R2 is DCE, and which is DTE.  Set a clock rate of 64 KB/s on the DCE side.
3. What are the default CDP send and hold timers?  Confirm this with a show command on one of the devices.
4. Disable CDP globally on R1, and attempt to view CDP neighbors.
5. Enable CDP globally on R1, and immediately view CDP neighbors again.  Do SW1 and R2 appear instantly?
6. Disable CDP on the switch interfaces connected to PCs.

R1>en
R1#sh cdp neighbors
Capability Codes: R - Router, T - Trans Bridge, B - Source Route Bridge
                  S - Switch, H - Host, I - IGMP, r - Repeater, P - Phone
Device ID    Local Intrfce   Holdtme    Capability   Platform    Port ID
SW1          Fas 0/0          139            S       2960        Fas 0/1
R2           Ser 2/0          148            R       PT1000      Ser 2/0

R2>en
R2#sh cdp neighb
R2#sh cdp neighbors 
Capability Codes: R - Router, T - Trans Bridge, B - Source Route Bridge
                  S - Switch, H - Host, I - IGMP, r - Repeater, P - Phone
Device ID    Local Intrfce   Holdtme    Capability   Platform    Port ID
SW2          Fas 0/0          159            S       2960        Fas 0/1
R1           Ser 2/0          159            R       PT1000      Ser 2/0

R1#sh controllers s2/0
Interface Serial2/0
Hardware is PowerQUICC MPC860
DCE V.35, clock rate 2000000

R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#int s2/0
R1(config-if)#clock rate 64000
R1(config-if)#end

R1#sh cdp interface 
FastEthernet0/0 is up, line protocol is up
  Sending CDP packets every 60 seconds
  Holdtime is 180 seconds
FastEthernet1/0 is administratively down, line protocol is down
  Sending CDP packets every 60 seconds
  Holdtime is 180 seconds
Serial2/0 is up, line protocol is up
  Sending CDP packets every 60 seconds
  Holdtime is 180 seconds

R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#no cdp run
R1(config)#do sh cdp neigh
% CDP is not enabled
R1(config)#cdp run
R1(config)#do sh cdp neigh
Capability Codes: R - Router, T - Trans Bridge, B - Source Route Bridge
                  S - Switch, H - Host, I - IGMP, r - Repeater, P - Phone
Device ID    Local Intrfce   Holdtme    Capability   Platform    Port ID
SW1          Fas 0/0          154            S       2960        Fas 0/1
R2           Ser 2/0          163            R       PT1000      Ser 2/0

SW1>en
SW1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#int range f0/3-4
SW1(config-if-range)#no cdp enable

SW2>en
SW2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW2(config)#int range f0/3-4
SW2(config-if-range)#no cdp enable
