1. Ping between the PCs.  Which pings succeed?

2. Assign PC1 and PC3 to VLAN 13, and PC2 and PC4 to VLAN 24.

3. Create a trunk link between SW1 and SW2.  

4. Configure inter-VLAN routing by using subinterfaces on R1's G0/0 interface.  Use an address of 10.0.0.1/25 for VLAN 13 and 10.0.0.129/25 for VLAN 24.

5. Test connectivity by pinging between PCs.

C:\>ping 10.0.0.130

Pinging 10.0.0.130 with 32 bytes of data:

Request timed out.
Request timed out.
Request timed out.
Request timed out.

Ping statistics for 10.0.0.130:
    Packets: Sent = 4, Received = 0, Lost = 4 (100% loss),

C:\>ping 10.0.0.3

Pinging 10.0.0.3 with 32 bytes of data:

Reply from 10.0.0.3: bytes=32 time<1ms TTL=128
Reply from 10.0.0.3: bytes=32 time<1ms TTL=128
Reply from 10.0.0.3: bytes=32 time<1ms TTL=128
Reply from 10.0.0.3: bytes=32 time<1ms TTL=128

Ping statistics for 10.0.0.3:
    Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
    Minimum = 0ms, Maximum = 0ms, Average = 0ms

SW1>en
SW1#config t
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#int f0/1
SW1(config-if)#switchport mode access
SW1(config-if)#switchport access vlan 13
% Access VLAN does not exist. Creating vlan 13
SW1(config-if)#int f0/2
SW1(config-if)#switchport mode access
SW1(config-if)#switchport access vlan 24
% Access VLAN does not exist. Creating vlan 24
SW1(config-if)#end
SW1#
%SYS-5-CONFIG_I: Configured from console by console

SW1#copy run start

SW2>en
SW2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW2(config)#int f0/1
SW2(config-if)#switchport mode access
SW2(config-if)#switchport access vlan 13
% Access VLAN does not exist. Creating vlan 13
SW2(config-if)#int f0/2
SW2(config-if)#switchport mode access
SW2(config-if)#switchport access vlan 24
% Access VLAN does not exist. Creating vlan 24
SW2(config-if)#end
SW2#
%SYS-5-CONFIG_I: Configured from console by console

SW2#copy run start

SW1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#int g0/2
SW1(config-if)#switchport mode trunk

SW1(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/2, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/2, changed state to up

SW1(config-if)#end
SW1#
%SYS-5-CONFIG_I: Configured from console by console

SW1#copy run start

SW2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW2(config)#int g0/1
SW2(config-if)#switchport mode trunk
SW2(config-if)#end
SW2#
%SYS-5-CONFIG_I: Configured from console by console

SW2#copy run start

SW1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#int g0/1
SW1(config-if)#switchport mode trunk

SW1(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up

SW1(config-if)#end
SW1#
%SYS-5-CONFIG_I: Configured from console by console

SW1#copy run start

R1>en
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#int g0/0
R1(config-if)#no shut

R1(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up

R1(config-if)#int g0/0.13
R1(config-subif)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0.13, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0.13, changed state to up

R1(config-subif)#encap dot1q 13
R1(config-subif)#ip address 10.0.0.1 255.255.255.128
R1(config-subif)#int g0/0.24
R1(config-subif)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0.24, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0.24, changed state to up

R1(config-subif)#encap dot1q 24
R1(config-subif)#ip address 10.0.0.129 255.255.255.128
R1(config-subif)#end
R1#
%SYS-5-CONFIG_I: Configured from console by console

R1#copy run start

C:\>ping 10.0.0.130

Pinging 10.0.0.130 with 32 bytes of data:

Reply from 10.0.0.130: bytes=32 time<1ms TTL=127
Reply from 10.0.0.130: bytes=32 time<1ms TTL=127
Reply from 10.0.0.130: bytes=32 time<1ms TTL=127
Reply from 10.0.0.130: bytes=32 time<1ms TTL=127

Ping statistics for 10.0.0.130:
    Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
    Minimum = 0ms, Maximum = 0ms, Average = 0ms

C:\>ping 10.0.0.3

Pinging 10.0.0.3 with 32 bytes of data:

Reply from 10.0.0.3: bytes=32 time<1ms TTL=128
Reply from 10.0.0.3: bytes=32 time<1ms TTL=128
Reply from 10.0.0.3: bytes=32 time<1ms TTL=128
Reply from 10.0.0.3: bytes=32 time<1ms TTL=128

Ping statistics for 10.0.0.3:
    Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
    Minimum = 0ms, Maximum = 0ms, Average = 0ms
